// 1. Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.

let numPolidrom = prompt("введите пятиразрядное число, определим является ли оно палиндромом");
if (numPolidrom.toString().split("").reverse().join("") == numPolidrom.toString()) {
    alert('Это палиндром');
} else {
    alert('Это не палиндром');
}

/* .toString() — переводит число в строку.
split("") — разбивает строку на массив из символов. 
В кавычках принцип разделения — если бы там была точка, то разделили бы на местах точек. 
А так как там пустота, то делится вообще по каждому из символов.
reverse() — меняет элементы в массиве в обратном порядке.
join("") — добавляет результат к пустой строке, чтобы на выходе получить строку в обратном порядке. */



// 2. Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%; 
// від 300 до 500 - 5%;
// від 500 і вище - 7%.

let yourPrice = +prompt('Введите сумму покупки для определения стоимости с учетом скидки', '');
  if (yourPrice < 200) {
  sum = yourPrice;
  alert(`На эту сумму не распространяется скидка, к оплате ${sum}`);
}
else if (yourPrice >= 200 && yourPrice < 300) {
  // вычисляем сумму скидки
  discountPrice = (yourPrice / 100) * 3;
  // вычисляем общую сумму покупки
  sum = yourPrice - discountPrice;
  alert(`Сумма к оплате с учетом вашей скидки составляет ${sum} (Ваша скидка 3 %)`);
}
else if  (yourPrice >= 300 && yourPrice < 500) {
  discountPrice = (yourPrice / 100) * 5;
  sum = yourPrice - discountPrice;
  alert(`Сумма к оплате с учетом вашей скидки составляет ${sum} (Ваша скидка 5 %)`);
}
else if (yourPrice >= 500) {
  discountPrice = (yourPrice / 100) * 7;
  sum = yourPrice - discountPrice;
  alert(`Сумма к оплате с учетом вашей скидки составляет ${sum} (Ваша скидка 7 %)`);
}


// 3. Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. 
// При цьому також порахуй, скільки з них парних і непарних. 
// Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.



// 4. Зацикли відображення днів тижня таким чином: 
// «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.

let days = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
let currDay = 0;

while (confirm(`${days[currDay]}. Хотите увидеть следующий день?`)) {
  currDay = (currDay + 1) % days.length;
}

