// 1. Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.

alert(`1. Виконай додавання 0,1 i 0,2 добийся математично правильної відповіді.`);

alert((0.1*10 + 0.2*10)/10);
console.log((0.1*10 + 0.2*10)/10);

// 2. Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

alert(`2. Виконай додавання рядка "1" i цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.`);

let numberOne = "1";
    numberTwo = 2;
console.log(+numberOne + +numberTwo);
//or
console.log(Number(numberOne) + Number(numberTwo));


// 3. Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

alert(`3. Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.`);

const file = 820;
let howGb = prompt("Kакой объем флешки, в Гб", '');
alert("Один файл весит 820 Мб"); 
let howFiles = ((howGb * 1024) / howFile);
alert(`Hа флешку влезет ${howFiles} файла`);
